# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку
# разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам
# стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число
# гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
# слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг
# от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
# напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке.

# Ввод:
# пара-ра-рам рам-пам-папам па-ра-па-дам
# Вывод:
# Парам пам-пам


def inputPoem():
    try:
        text = input('Придумайте стихотворение: ')
    except Exception:
        print('Что-то не так. Попробуйте ещё раз.')
    return text


def haveRhythm(poem):
    vovels = ('а', 'е', 'ё', 'и', 'о', 'у', 'ы', 'э', 'ю', 'я')
    phrases = list(poem.split())
    syllables = []
    for i in range(len(phrases)):
        count = 0
        for char in phrases[i]:
            if char.lower() in vovels:
                count += 1
        syllables.append(count)
    if min(syllables) == max(syllables):
        rhythm = True
    else:
        rhythm = False
    return rhythm


def main():
    poem = inputPoem()
    if haveRhythm(poem):
        print('Парам пам-пам')
    else:
        print('Пам парам')


if __name__ == '__main__':
    main()
